src/test/resources/plays/invoices/create.yaml

!play
interactions:
-
  request:
    uri: /v2/invoices
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"INV-B36128A22351","amount":{"total":1000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":1000}},"items":[{"product":"My Invoice Product","detail":"My Invoice Detail","price":1000}],"customer":{"email":"vavagner.vieira@moip.com.br"},"status":"DELIVERED","createdAt":"2017-04-05T14:28:04.400-00","updatedAt":"2017-04-05T14:28:04.509-00","_links":{"self":{"href":"/invoice/INV-4EF9F98485C7"},"checkout":{"pay":{"redirectHref":"https://checkout-new.moip.com.br?id=INV-4EF9F98485C7\u0026token=4e2483f3-2b7f-40e7-9348-8ebd8c1915dd"}}}}